package step_11_1_generics.information;

public class Main {
    /*
    Обобщения – это способность класса/интерфейса/метода быть универсальными в определении типов данных, с которыми они
    работают. Пользователи, в свою очередь, могут быть конкретными в типах данных во время создания объекта или вызова
    метода.

    Появление обобщений привнесло свои преимущества в код:
    Безопасность типа - обобщения обеспечивают безопасность типа во время компиляции. Это возможно, так как ошибки,
    связанные с использованием типов данных, и ошибки, которые могли возникнуть во время исполнения, теперь выявляются
    на этапе компиляции.
    Ненужность приведения типов - обобщения устраняют необходимость явного приведения типов между объектами, поскольку
    компилятор уже информирован, с какими типами данных производится работа.
    Однородные коллекции - обобщения обеспечивают возможность создания проверяемых компилятором однородных коллекций.
    Другими словами, обобщения гарантируют, что все операции с элементами коллекции являются корректными, так как
    компилятор информирован о типах элементов коллекции и может выполнить проверки.

    Наиболее часто используемые обозначения параметров типов:

    Е – Element: для элементов коллекций
    T – Type: для любого типа
    K – Key: для ключа
    V – Value: для значения
    N – Number: для числовых данных
    S, U, V и так далее - для 2, 3, 4 параметров типа.
     */
}
